fix: bug on signal avoid the blocking busybox init
